ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РешениеОЕдиновременнойВыплате</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЕдиновременнойВыплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительнаяВыплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоначислениеПоПереданномуВзносуИзПФР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_РазмерГП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_СрокПП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаГосПенсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ХМ_ДатаСозданияДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеУчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаСуммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорОПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаГарантированная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаКомпенсации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВосполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СуммаВозмещения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ХМ_ДатаВыплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_РешениеОЕдиновременнойВыплате/Ext/ManagerModule.bsl
&ИзменениеИКонтроль("ПечатьРешения")
Функция ХМПечатьРешения(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ХМ_ПечататьРасчет)

	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;

	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;

	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);

	ПервыйДокумент = Истина;
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл

		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		Если ОбъектПечати.ДополнительнаяВыплата или ОбъектПечати.ДоначислениеПоПереданномуВзносуИзПФР Тогда
			Продолжить;	
		КонецЕсли;


		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;

		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);

		ТаблицаДокумента = Новый ТаблицаЗначений;
		ТаблицаДокумента.Колонки.Добавить("Документ");
		ТаблицаДокумента.Колонки.Добавить("Ссылка");
		ТаблицаДокумента.Колонки.Добавить("Организация");
		ТаблицаДокумента.Колонки.Добавить("Руководитель");


		СведенияОДокументе = ТаблицаДокумента.Добавить();
		СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
		СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
		СведенияОДокументе.Организация = ОбъектПечати.Организация;
		СведенияОДокументе.Руководитель = Руководители.Руководитель;

		Если ОбъектПечати.Дата < Дата("20150101") Тогда
			Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОВыплате");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОЕдиновременнойВыплате.ПФ_MXL_РешениеОВыплате2015");
		КонецЕсли;

		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, ОбъектПечати.Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");


		Область = Макет.ПолучитьОбласть("Решение");
		Область.Параметры.Число = Формат(ОбъектПечати.Дата, "ДФ=дд");
		Область.Параметры.Месяц = Сред(Формат(ОбъектПечати.Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ОбъектПечати.Дата, "ДЛФ=дд")))-10);
		Область.Параметры.Год = Формат(ОбъектПечати.Дата, "ДФ=гггг");
		Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
		Область.Параметры.НомерРешения = ОбъектПечати.Номер;

		ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(ОбъектПечати.Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
		Фамилия = ФИОФизЛица.Фамилия;
		Имя = ФИОФизЛица.Имя;                
		Отчество = ФИОФизЛица.Отчество;
		//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
		Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество;
		Область.Параметры.НомерСчета = ОбъектПечати.ДоговорОПС.НомерЛицевогоСчета;

		Если ЗначениеЗаполнено(ОбъектПечати.ДокументОснование) Тогда
			ВидДокументаОснования       = ОбъектПечати.ДокументОснование.Метаданные().Имя; 
			#Вставка 
			// +ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №3244
			Область.Параметры.ДатаРегистрации = ОбъектПечати.ДокументОснование.Дата;
			// -ХМНПФ 04.06.2021 ШадринАВ // ПечатьРешенияОВыплатеСервер() // №3244 			
			#КонецВставки 
			#Удаление 
			Если ВидДокументаОснования = "уп_ЗаявлениеЗЛОНазначенииНЧТП" Тогда
				Область.Параметры.ДатаРегистрации = ОбъектПечати.ДокументОснование.Дата;
			Иначе
				Область.Параметры.ДатаРегистрации = ОбъектПечати.ДокументОснование.ДатаРегистрации;
			КонецЕсли;				
			#КонецУдаления
			
			Область.Параметры.НомерЗаявления = СокрЛП(ОбъектПечати.ДокументОснование.Номер);
		Конецесли;

		Если ОбъектПечати.ТипЕдиновременнойВыплаты = 0 Тогда
			Область.Параметры.Подпункт = "а";
		Иначе
			Область.Параметры.Подпункт = "б";
		КонецЕсли;

		ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
		ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		Область.Параметры.Сумма=ОбъектПечати.СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
		Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(ОбъектПечати.СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		Область.Параметры.Копейки      = Формат(Цел((ОбъектПечати.СуммаНаСчете-Цел(ОбъектПечати.СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");

		СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",ОбъектПечати.Дата);
		Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
			Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;
			Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+"."+" "+Лев(СведенияОбОтветственном.Отчество,1)+".";
		Иначе
			Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
			Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
		КонецЕсли;	

		ТабличныйДокумент.Вывести(Область); 

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);
		
		#Вставка 
		// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84
		хмОбъектПечати = ОбъектПечати.ПолучитьОбъект();
		Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(хмОбъектПечати,ТабличныйДокумент) КонецЕсли;
		// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОВыплате() // №84	
		#КонецВставки
		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати);
		УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, СведенияОДокументе.Документ);
	КонецЦикла;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
КонецФункции

&ИзменениеИКонтроль("ПечатьРешенияОДопВыплате")
Функция ХМПечатьРешенияОДопВыплате(МассивОбъектов, ОбъектыПечати, ПараметрыПечати, ХМ_ПечататьРасчет)
	// -ХМНПФ 28.02.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №830

	ИмяПараметровПечати = ПараметрыПечати.ИмяПараметровПечати;

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;

	ТабличныйДокумент.КлючПараметровПечати = ИмяПараметровПечати;

	//УстановитьМинимальныеПоляПечати(ТабличныйДокумент);

	ПервыйДокумент = Истина;
	Для Каждого ОбъектПечати Из МассивОбъектов Цикл

		Если ОбъектПечати.ПометкаУдаления Тогда
			Продолжить;	
		КонецЕсли;
		Если НЕ ОбъектПечати.ДополнительнаяВыплата И НЕ ОбъектПечати.ДоначислениеПоПереданномуВзносуИзПФР Тогда
			Продолжить;	
		КонецЕсли;


		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ПервыйДокумент = Ложь;

		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;

		Руководители = ОтветственныеЛицаБП.ОтветственныеЛица(ОбъектПечати.Организация, ОбъектПечати.Дата);

		ТаблицаДокумента = Новый ТаблицаЗначений;
		ТаблицаДокумента.Колонки.Добавить("Документ");
		ТаблицаДокумента.Колонки.Добавить("Ссылка");
		ТаблицаДокумента.Колонки.Добавить("Организация");
		ТаблицаДокумента.Колонки.Добавить("Руководитель");


		СведенияОДокументе = ТаблицаДокумента.Добавить();
		СведенияОДокументе.Документ = ОбъектПечати.Ссылка;
		СведенияОДокументе.Ссылка = ОбъектПечати.Ссылка;
		СведенияОДокументе.Организация = ОбъектПечати.Организация;
		СведенияОДокументе.Руководитель = Руководители.Руководитель;

		Если ОбъектПечати.Дата < Дата("20150101") Тогда
			Макет = Документы.уп_РешениеОЕдиновременнойВыплате.ПолучитьМакет("РешениеОДопВыплате");
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уп_РешениеОЕдиновременнойВыплате.ПФ_MXL_РешениеОДопВыплате2015");
		КонецЕсли;

		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(ОбъектПечати.Организация, ОбъектПечати.Дата);
		ПредставлениеОрганизации = ФормированиеПечатныхФорм.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");

		Область = Макет.ПолучитьОбласть("Решение");
		Область.Параметры.Число = Формат(ОбъектПечати.Дата, "ДФ=дд");
		Область.Параметры.Месяц = Сред(Формат(ОбъектПечати.Дата, "ДЛФ=дд"), 3, СтрДлина(Строка(Формат(ОбъектПечати.Дата, "ДЛФ=дд")))-10);
		Область.Параметры.Год = Формат(ОбъектПечати.Дата, "ДФ=гггг");
		Область.Параметры.НаименованиеФонда = ПредставлениеОрганизации;
		Область.Параметры.НомерРешения = ОбъектПечати.Номер;

		ФИОФизЛица = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(ОбъектПечати.Дата, Новый Структура("ФизическоеЛицо", ОбъектПечати.ДоговорОПС.Участник.уп_ФизЛицо));
		Фамилия = ФИОФизЛица.Фамилия;
		Имя = ФИОФизЛица.Имя;                
		Отчество = ФИОФизЛица.Отчество;
		//Область.Параметры.ФИОНомерСчета = Фамилия+" "+Имя+" "+Отчество+", "+уп_ОПС.ПреобразоватьНомерПФР(ДоговорОПС.Участник.уп_ФизЛицо.СтраховойНомерПФР);
		Область.Параметры.ФИО = Фамилия+" "+Имя+" "+Отчество+", ";
		Область.Параметры.НомерСчета = ОбъектПечати.ДоговорОПС.НомерЛицевогоСчета;
		//Область.Параметры.ДатаРегистрации = ДокументОснование.ДатаРегистрации;
		//Область.Параметры.НомерЗаявления = СокрЛП(ДокументОснование.Номер); 

		ВалютаПечати = Константы.ВалютаРегламентированногоУчета.Получить();
		ПараметрыПрописиНаРусском = ВалютаПечати.ПараметрыПрописи;
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "1", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "2", "0");
		ПараметрыПрописиНаРусском = СтрЗаменить(ПараметрыПрописиНаРусском, "3", "0");
		Область.Параметры.Сумма=ОбъектПечати.СуммаНаСчете; //ММВ Добавлена сумма числом (рядом с сумой прописью и отцентрировали)
		Область.Параметры.РублиПрописью = ЧислоПрописью(Цел(ОбъектПечати.СуммаНаСчете), "L=ru_RU; НП=Ложь; НД=Ложь", ПараметрыПрописиНаРусском);
		Область.Параметры.Копейки      = Формат(Цел((ОбъектПечати.СуммаНаСчете-Цел(ОбъектПечати.СуммаНаСчете))*100), "ЧЦ=2; ЧН=00");

		СведенияОбОтветственном = уп_ПользовательскиеНастройкиСервер.ПолучитьСведенияОбУполномоченномЛице(Документы.уп_РешениеОЕдиновременнойВыплате.ПустаяСсылка(),ОбъектПечати.Организация,ОбъектПечати.ДоговорОПС.Филиал,Пользователи.ТекущийПользователь(),"Решение",ОбъектПечати.Дата);
		Если ЗначениеЗаполнено(СведенияОбОтветственном.Фамилия) Тогда
			#Удаление 
			Область.Параметры.ДолжностьРуководителя = СведенияОбОтветственном.Должность;	
			#КонецУдаления
			#Вставка			
			// +ХМНПФ 17.08.2017 ШадринАВ // ПечатьРешенияОДопВыплате() // №1131 
			#КонецВставки
           	Область.Параметры.ФИОРуководителя = СведенияОбОтветственном.Фамилия+" "+Лев(СведенияОбОтветственном.Имя,1)+". "+Лев(СведенияОбОтветственном.Отчество,1)+".";
		Иначе
			Область.Параметры.ФИОРуководителя = Руководители.РуководительПредставление;
			Область.Параметры.ДолжностьРуководителя = Руководители.РуководительДолжность;
		КонецЕсли;	

		ТабличныйДокумент.Вывести(Область); 

		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, СведенияОДокументе.Документ);

		//УправлениеПечатьюБП.ДополнитьДокументПодписьюИПечатью(ТабличныйДокумент, СведенияОДокументе, ОбъектыПечати, ПараметрыПечати); 
		УправлениеПечатьюБП.ДоработатьФаксимильнуюПодписьИПечать(ТабличныйДокумент, ОбъектыПечати, ОбъектПечати.Организация, СведенияОДокументе.Документ);
		#Вставка 
		// +ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
		//Если ХМ_ПечататьРасчет Тогда ХМ_ФункцииОтчетов.ПечатьРешения_ДобавитьРасчет(ОбъектПечати,ТабличныйДокумент) КонецЕсли;
		// -ХМНПФ 14.12.2015 ЛыткинАМ // ПечатьРешенияОДопВыплате() // №84
		#КонецВставки
	КонецЦикла;

	Возврат ТабличныйДокумент;
КонецФункции
